public class Main {
    public static void main(String[] args) {
        /*
        [1년 미만 근속자 : 1차 촉진]
        - 1-1 (입사 후 최초 9개월까지 발생하는 연차 9개) :
        입사일로부터 1년이 되는 날의 3개월 전을 기준으로 10일 이내에 회사가 각 근로자별로 사용하지 않은 연차 일수를 서면으로 통보
        - 1-2 (1-1의 조치 후 발생한 2일의 연차 2개) :
        입사일로부터 1년이 되는 날의 1개월 전을 기준으로 5일 이내에 회사가 각 근로자별로 사용하지 않은 연차 일수를 서면으로 통보
        [1년 미만 근속자 : 2차 촉진]
        - (위1-1의 연차) 입사일로부터 1년이 되는 날의 1개월 전까지 회사가 각 근로자에게 사용할 시기를 지정하여 통보
        - (위1-2의 연차) 입사일로부터 1년이 되는 날의 10일 전까지 회사가 각 근로자에게 사용할 시기를 지정하여 통보

        [1년 이상 근속자 : 1차 촉진]
        1. 연차휴가가 부여된 날(1월 1일)부터 1년이 되는 날(12월 31일)의 6개월 전(7월 1일)을 기준으로 10일 이내에(7월 1일 ~ 7월 10일)
        회사가 각 근로자별로 잔여 연차 일수를 서면으로 통보
        2. 근로자가 서면 통보를 받은 날로부터 10일 이내에 근로자가 휴가를 사용할 시기를 정해서 회사에 회신
        [1년 이상 근속자 : 2차 촉진]
        연차휴가가 부여된 날로부터 1년이 되는 날의 2개월 전(10월 31일)까지 회사가 각 근로자에게 잔여 연차를 사용할 시기를 지정하여 통보
        */



    }

}